{"class_name": "Model", "keras_version": "2.0.8", "config": {"name": "model_1", "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 66, 200, 3]}}, {"name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"arguments": {}, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u000bmodel_v2.py\u00da\b<lambda>\u001e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "output_shape": null}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "filters": 24, "trainable": true, "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "filters": 36, "trainable": true, "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "filters": 48, "trainable": true, "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"name": "dropout_3", "rate": 0.2, "trainable": true}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "filters": 64, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"name": "dropout_4", "rate": 0.2, "trainable": true}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_5", "filters": 64, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"name": "dropout_5", "rate": 0.2, "trainable": true}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"name": "dropout_6", "rate": 0.5, "trainable": true}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"name": "dropout_7", "rate": 0.5, "trainable": true}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.30000001192092896}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}]}, "backend": "tensorflow"}